
// ==============================================start=================================================

// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

/*
Console.Write("Введите число: ");
int num=Convert.ToInt32(Console.ReadLine());
void PrintNum(int number){
    Console.Write(number +" ");
    if(number>1){
        PrintNum(number-1);
    }
}
PrintNum(num);
*/
// ================================================end====================================================


// ===================================================start=====================================================

// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

/*
Console.Write("Введите число m: ");
int n=Convert.ToInt32(Console.ReadLine());
Console.Write("Введите число n: ");
int m=Convert.ToInt32(Console.ReadLine());
int sum=0;
int PrintNum(int num1,int num2){
    sum+=num2;
    if(num2>num1){
       PrintNum(num1,num2-1);
    }
    return sum;
}
int result=PrintNum(n,m);
Console.WriteLine(result);
*/

// ================================================== end====================================================


// ====================================================start ================================================

// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29

// int AkkermanFunction(int m,int n){
    
// }

// Console.WriteLine(AkkermanFunction(2,3));

// ===================================================endd===============================================